#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ __E820MAP_H
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ __E820MAP_H

#ਅਨ੍ਤਰ੍ਭਾਵ "types.h" // u64

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ E820_RAM            1
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ E820_RESERVED       2
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ E820_ACPI           3
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ E820_NVS            4
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ E820_UNUSABLE       5
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ E820_SOFT_RESERVED  0xEFFFFFFF

ਬਣਤਰ e820entry {
    u64 ਸ਼ੁਰੂ;
    u64 ਮਾਪ;
    u32 type;
};

ਖਾਲੀ e820_ਜੋੜੋ(u64 ਸ਼ੁਰੂ, u64 ਮਾਪ, u32 type);
ਖਾਲੀ e820_remove(u64 ਸ਼ੁਰੂ, u64 ਮਾਪ);
ਖਾਲੀ e820_prepboot(ਖਾਲੀ);
ਪੂਰਨ e820_is_ਵਰਤਿਆ(u64 ਸ਼ੁਰੂ, u64 ਮਾਪ);

// e820 map storage
ਬਾਹਰੀ ਬਣਤਰ e820entry e820_list[];
ਬਾਹਰੀ ਪੂਰਨ e820_ਗਿਣਤੀ;

#ਜੇ_ਅੰਤ // e820map.h
