#جيڪڏهن_وصف_نه_ٿيل __E820MAP_H
#وصف_ڪريو __E820MAP_H

#ضمن "types.h" // u64

#وصف_ڪريو E820_RAM            1
#وصف_ڪريو E820_RESERVED       2
#وصف_ڪريو E820_ACPI           3
#وصف_ڪريو E820_NVS            4
#وصف_ڪريو E820_UNUSABLE       5
#وصف_ڪريو E820_SOFT_RESERVED  0xEFFFFFFF

بنية e820entry {
    u64 شروعات;
    u64 سائيز;
    u32 type;
};

فراغ e820_جوڙيو(u64 شروعات, u64 سائيز, u32 type);
فراغ e820_remove(u64 شروعات, u64 سائيز);
فراغ e820_prepboot(فراغ);
صحيح e820_is_استعمال_ٿيل(u64 شروعات, u64 سائيز);

// e820 map storage
خارجي بنية e820entry e820_list[];
خارجي صحيح e820_ڳڻپ;

#جيڪڏهن_پورو // e820map.h
