#నిర్వచితం_కాకపోతే __E820MAP_H
#నిర్వచించు __E820MAP_H

#అన్తర్భావ "types.h" // u64

#నిర్వచించు E820_RAM            1
#నిర్వచించు E820_RESERVED       2
#నిర్వచించు E820_ACPI           3
#నిర్వచించు E820_NVS            4
#నిర్వచించు E820_UNUSABLE       5
#నిర్వచించు E820_SOFT_RESERVED  0xEFFFFFFF

నిర్మాణం e820entry {
    u64 ప్రారంభం;
    u64 కొలత;
    u32 type;
};

శూన్య e820_కూడు(u64 ప్రారంభం, u64 కొలత, u32 type);
శూన్య e820_remove(u64 ప్రారంభం, u64 కొలత);
శూన్య e820_prepboot(శూన్య);
పూర్ణాంకం e820_is_వాడిన(u64 ప్రారంభం, u64 కొలత);

// e820 map storage
బాహ్య నిర్మాణం e820entry e820_list[];
బాహ్య పూర్ణాంకం e820_లెక్క;

#అయితే_ముగింపు // e820map.h
