#که_نه_تعریف_شوی __E820MAP_H
#تعریف_کړه __E820MAP_H

#ضمن "types.h" // u64

#تعریف_کړه E820_RAM            1
#تعریف_کړه E820_RESERVED       2
#تعریف_کړه E820_ACPI           3
#تعریف_کړه E820_NVS            4
#تعریف_کړه E820_UNUSABLE       5
#تعریف_کړه E820_SOFT_RESERVED  0xEFFFFFFF

بنية e820entry {
    u64 پیل;
    u64 اندازه;
    u32 type;
};

فراغ e820_جمع_کړه(u64 پیل, u64 اندازه, u32 type);
فراغ e820_remove(u64 پیل, u64 اندازه);
فراغ e820_prepboot(فراغ);
صحيح e820_is_کارول_شوی(u64 پیل, u64 اندازه);

// e820 map storage
خارجي بنية e820entry e820_list[];
خارجي صحيح e820_شمېر;

#د_که_پای // e820map.h
