#اگر_تعریف_نشده __E820MAP_H
#تعریف_کن __E820MAP_H

#ضمن "types.h" // u64

#تعریف_کن E820_RAM            1
#تعریف_کن E820_RESERVED       2
#تعریف_کن E820_ACPI           3
#تعریف_کن E820_NVS            4
#تعریف_کن E820_UNUSABLE       5
#تعریف_کن E820_SOFT_RESERVED  0xEFFFFFFF

بنية e820entry {
    u64 شروع;
    u64 اندازه;
    u32 type;
};

فراغ e820_جمع_کن(u64 شروع, u64 اندازه, u32 type);
فراغ e820_remove(u64 شروع, u64 اندازه);
فراغ e820_prepboot(فراغ);
صحيح e820_is_استفاده_شده(u64 شروع, u64 اندازه);

// e820 map storage
خارجي بنية e820entry e820_list[];
خارجي صحيح e820_شمار;

#پایان_اگر // e820map.h
